введите до 10 слов
введите список: раз, два, три, четыре,пять, шесть, семь, восемь, девять, десять
количество слов: 10
{'с', 'в', 'е', ' ', 'ч', 'м', 'з', 'я', 'о', 'т', 'д', 'и', 'п', 'а', ',', 'ы', 'ш', 'ь', 'р'}
введите второй список :
десять, девять, восемь, семь, шесть, пять, четыре, три, два, один
количество слов: 10
{'с', 'в', 'е', ' ', 'ч', 'м', 'я', 'о', 'т', 'д', 'и', 'п', 'а', ',', 'ы', 'ш', 'н', 'ь', 'р'}
количество слов равно в 2-х списках
словарь
{'раз': 'десять', ' два': ' девять', ' три': ' восемь', ' четыре': ' семь', ' пять': ' шесть',
 ' шесть': ' пять', ' семь': ' четыре', ' восемь': ' три', ' девять': ' два', ' десять': ' один'}
